contrib/axismora/samples/toprocess/req6


==============
Listen Port: 5555
Target Host: 127.0.0.1
Target Port: 4444
==== Request ====
POST / HTTP/1.0
Content-Type: text/xml; charset=utf-8
Accept: application/soap+xml, application/dime, multipart/related, text/*
User-Agent: Axis/1.1
Host: 127.0.0.1
Cache-Control: no-cache
Pragma: no-cache
SOAPAction: "InteropTests"
Content-Length: 495

<?xml version="1.0" encoding="UTF-8"?>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
 <soapenv:Body>
  <ns1:echoBase64 soapenv:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/" xmlns:ns1="http://soapinterop.org/">
   <inputBase64 xsi:type="xsd:base64Binary">YzJWdVpHbHVaeUJDWVhObE5qUT0=</inputBase64>
  </ns1:echoBase64>
 </soapenv:Body>
</soapenv:Envelope>==== Response ====
HTTP/1.1 200 OK
Content-Type: text/xml; charset="utf-8"

<?xml version="1.0" encoding="UTF-8"?>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
 <soapenv:Body><pre:echoBase64Response xmlns:pre="http://soapinterop.org/" xmlns:soapenc="http://schemas.xmlsoap.org/soap/encoding/">
<base64Binary xsi:type="ns1:base64Binary" xmlns:ns1 ="http://www.w3.org/2001/XMLSchema">YzJWdVpHbHVaeUJDWVhObE5qUT0=</base64Binary>
</pre:echoBase64Response>
</soapenv:Body>
</soapenv:Envelope>

==============
